//𝗪𝗵𝗮𝘁 𝗶𝘀 𝗼𝘂𝘁𝗽𝘂𝘁 𝘁𝗼 𝗰𝗼𝗻𝘀𝗼𝗹𝗲 & 𝘄𝗵𝘆 ?
//-------------------------------------------------------------------

let x =10;

function myFunc(y){
y= 12;
}
myFunc(x);
console.log(x); 

ans :  10 

//------------------------------------------------------------------------

console.log(new String("yes")===new String("yes"));
console.log("yes"==="yes");

ans : FALSE, TRUE

//------------------------------------------------------------------------

const x = new String("tricky");

const y = x;
console.log(x===y);

ans : TRUE 

//------------------------------------------------------------------------
